Тест_ЗУП_31_КОРП/src/ChartsOfCharacteristicTypes/ХарактеристикиПерсонала/ХарактеристикиПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ХарактеристикиПерсонала</name>
  <type>
    <types>CatalogRef.ЗначенияХарактеристикПерсонала</types>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>10</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <attributes>
    <name>ВидХарактеристики</name>
    <type>
      <types>EnumRef.ВидыХарактеристикПерсонала</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <comment>Помещено в архив</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

Тест_ЗУП_31_КОРП/src/InformationRegisters/ВопросыОценкиХарактеристикПерсонала/ВопросыОценкиХарактеристикПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВопросыОценкиХарактеристикПерсонала</name>
  <dimensions>
    <name>ХарактеристикаПерсонала</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/Enums/ВидыХарактеристикПерсонала/ВидыХарактеристикПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыХарактеристикПерсонала</name>
  <enumValues>
    <name>Знание</name>
  </enumValues>
  <enumValues>
    <name>Навык</name>
  </enumValues>
  <enumValues>
    <name>ЛичноеКачество</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/МероприятияОценкиПерсонала/МероприятияОценкиПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МероприятияОценкиПерсонала</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонАнкеты</name>
    <type>
      <types>CatalogRef.ШаблоныАнкет</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаполненияРеспондентов</name>
    <type>
      <types>EnumRef.СпособЗаполненияРеспондентовВОценке360</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтактнойИнформацииРеспонденты</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтактнойИнформацииСотрудники</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьШаблонСообщения</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьВопросыКомпетенций</name>
    <attributes>
      <name>Компетенция</name>
      <type>
        <types>CatalogRef.КомпетенцииПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВопросыХарактеристик</name>
    <attributes>
      <name>ХарактеристикаПерсонала</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеОпроса</name>
      <type>
        <types>DocumentRef.НазначениеОпросов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеспондентыЕдиныйНабор</name>
    <attributes>
      <name>Респондент</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РольРеспондента</name>
      <type>
        <types>CatalogRef.РолиРеспондентаОценкиПерсонала</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Респонденты</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Респондент</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РольРеспондента</name>
      <type>
        <types>CatalogRef.РолиРеспондентаОценкиПерсонала</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/ChartsOfCharacteristicTypes/ХарактеристикиПерсонала/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияХарактеристикПерсонала");
		
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
		
	ОбновитьСоставЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Значения.Количество() < 2 И Не ПараметрыЗаписи.Свойство("СПустымСпискомЗначений") Тогда
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект, ПараметрыЗаписи);
		ТекстВопроса = НСтр("ru = 'Характеристика имеет менее двух значений.
			|Необходимо настроить значения характеристики для использования при анкетировании.
			|Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПриПолученииДанныхНаСервере();
	
	ОбновитьСоставЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьЗначенияХарактеристикПерсонала(ТекущийОбъект);
	
	ЗаписатьВопросыОценкиХарактеристик();
			
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Для Каждого ТекущееЗначение Из ИзмененныеЗначения Цикл
		ОтобразитьИзменениеДанных(ТекущееЗначение.Значение, ВидИзмененияДанных.Изменение);
	КонецЦикла;
	ИзмененныеЗначения.Очистить();
	
	Оповестить("ЗаписьХарактеристикиПерсонала",,Объект.Ссылка);
	
	Если ПараметрыЗаписи.Свойство("ЗаписатьИЗакрыть") Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьПомеченныеНаУдаление(Команда)
	
	Элементы.ФормаПоказыватьПомеченныеНаУдаление.Пометка = Не Элементы.ФормаПоказыватьПомеченныеНаУдаление.Пометка;
	Если Элементы.ФормаПоказыватьПомеченныеНаУдаление.Пометка Тогда
		Элементы.Значения.ОтборСтрок = Новый ФиксированнаяСтруктура;
	Иначе
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("ПометкаУдаления", Ложь);
		Элементы.Значения.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Записать(Новый Структура("ЗаписатьИЗакрыть"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗначения

&НаКлиенте
Процедура ЗначенияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Не НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Значения.ТекущиеДанные;
	ТекущиеДанные.ПометкаУдаления = Ложь;
	ТекущиеДанные.ИндексКартинки = ИндексКартинкиЭлемента();
	
	Если Копирование Тогда
		ТекущиеДанные.Ссылка = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Значения.ТекущиеДанные;
	ТекущиеДанные.ПометкаУдаления = НЕ ТекущиеДанные.ПометкаУдаления;	
	ТекущиеДанные.ИндексКартинки = ?(ТекущиеДанные.ПометкаУдаления, ИндексКартинкиЭлементаПометкаУдаления(), ИндексКартинкиЭлемента());
	
КонецПроцедуры

&НаКлиенте
Процедура ВидХарактеристикиПриИзменении(Элемент)
	УстановитьСвойстваЭлементовПоведенческихИндикаторов(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВопросы

&НаКлиенте
Процедура ВопросыВопросНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Вопросы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ХарактеристикаПерсонала", Объект.Ссылка);
	
	ОткрытьФорму("Справочник.МероприятияОценкиПерсонала.Форма.СписокВопросовДляАнкетирования", ПараметрыФормы, Элементы.Вопросы); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыВопросОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Вопросы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Вопрос);
	ПараметрыФормы.Вставить("ХарактеристикаПерсонала", Объект.Ссылка);
	
	ОткрытьФорму("Справочник.МероприятияОценкиПерсонала.Форма.НастройкаВопросовДляАнкетирования", ПараметрыФормы, ЭтаФорма); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Вопросы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Вопрос = ВыбранноеЗначение;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере()

	ДоступныВопросы = ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ВопросыОценкиХарактеристикПерсонала);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокМероприятий, "Характеристика", Объект.Ссылка, Истина);
	
	ЗаполнитьЗначенияХарактеристик();
	ЗаполнитьСписокВопросов();
	
	УстановитьСвойстваЭлементовФормы();

КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()

	УстановитьСвойстваЭлементовПоведенческихИндикаторов(ЭтаФорма);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваЭлементовПоведенческихИндикаторов(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ВопросыГруппа",
		"Доступность",
		(НЕ Форма.Объект.Ссылка.Пустая()) И (Форма.Объект.ВидХарактеристики = ПредопределенноеЗначение("Перечисление.ВидыХарактеристикПерсонала.ЛичноеКачество")));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ВопросыДоступностьПоведенческихИндикаторовГруппа",
		"Видимость",
		Форма.Объект.ВидХарактеристики <> ПредопределенноеЗначение("Перечисление.ВидыХарактеристикПерсонала.ЛичноеКачество"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияХарактеристик()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияХарактеристикПерсонала.Ссылка,
		|	ЗначенияХарактеристикПерсонала.Наименование,
		|	ЗначенияХарактеристикПерсонала.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
		|	ЗначенияХарактеристикПерсонала.ПометкаУдаления,
		|	ВЫБОР
		|		КОГДА ЗначенияХарактеристикПерсонала.ПометкаУдаления
		|			ТОГДА &ИндексКартинкиЭлементаПометкаУдаления
		|		ИНАЧЕ &ИндексКартинкиЭлемента
		|	КОНЕЦ КАК ИндексКартинки
		|ИЗ
		|	Справочник.ЗначенияХарактеристикПерсонала КАК ЗначенияХарактеристикПерсонала
		|ГДЕ
		|	ЗначенияХарактеристикПерсонала.Владелец = &Владелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Запрос.УстановитьПараметр("ИндексКартинкиЭлемента", ИндексКартинкиЭлемента());
	Запрос.УстановитьПараметр("ИндексКартинкиЭлементаПометкаУдаления", ИндексКартинкиЭлементаПометкаУдаления());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Значения.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаЗначения = Значения.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗначения, Выборка);
		
	КонецЦикла;
	
	Если Элементы.ФормаПоказыватьПомеченныеНаУдаление.Пометка Тогда
		Элементы.Значения.ОтборСтрок = Новый ФиксированнаяСтруктура;
	Иначе
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("ПометкаУдаления", Ложь);
		Элементы.Значения.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВопросов()

	Если Не ДоступныВопросы Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли; 
	
	Вопросы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВопросыОценкиХарактеристикПерсонала.Вопрос КАК Вопрос
		|ИЗ
		|	РегистрСведений.ВопросыОценкиХарактеристикПерсонала КАК ВопросыОценкиХарактеристикПерсонала
		|ГДЕ
		|	ВопросыОценкиХарактеристикПерсонала.ХарактеристикаПерсонала = &ХарактеристикаПерсонала";
	
	Запрос.УстановитьПараметр("ХарактеристикаПерсонала", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Вопросы.Добавить(), ВыборкаДетальныеЗаписи);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗначенияХарактеристикПерсонала(ТекущийОбъект)

	ТаблицаЗначений = Значения.Выгрузить();
	ТаблицаЗначений.Колонки.Добавить("НомерСтроки", Метаданные.Справочники.ЗначенияХарактеристикПерсонала.Реквизиты.РеквизитДопУпорядочивания.Тип);
	
	НомерСтроки = 0;
	
	Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначений Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		СтрокаТаблицыЗначений.НомерСтроки = НомерСтроки;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НовыеЗначения.Наименование,
		|	НовыеЗначения.Ссылка,
		|	НовыеЗначения.НомерСтроки,
		|	НовыеЗначения.ПометкаУдаления
		|ПОМЕСТИТЬ ВТНовыеЗначения
		|ИЗ
		|	&НовыеЗначения КАК НовыеЗначения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НовыеЗначения.Наименование,
		|	НовыеЗначения.НомерСтроки КАК НомерСтроки,
		|	НовыеЗначения.ПометкаУдаления,
		|	ЗначенияХарактеристикПерсонала.Ссылка КАК Ссылка
		|ИЗ
		|	ВТНовыеЗначения КАК НовыеЗначения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияХарактеристикПерсонала КАК ЗначенияХарактеристикПерсонала
		|		ПО НовыеЗначения.Ссылка = ЗначенияХарактеристикПерсонала.Ссылка
		|ГДЕ
		|	(НовыеЗначения.Наименование <> ЗначенияХарактеристикПерсонала.Наименование
		|			ИЛИ НовыеЗначения.НомерСтроки <> ЗначенияХарактеристикПерсонала.РеквизитДопУпорядочивания
		|			ИЛИ НовыеЗначения.ПометкаУдаления <> ЗначенияХарактеристикПерсонала.ПометкаУдаления
		|			ИЛИ ЗначенияХарактеристикПерсонала.Ссылка ЕСТЬ NULL)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("НовыеЗначения", ТаблицаЗначений);	
	Запрос.УстановитьПараметр("Владелец", ТекущийОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			ОбъектЗначенияХарактеристики = Справочники.ЗначенияХарактеристикПерсонала.СоздатьЭлемент();
			ОбъектЗначенияХарактеристики.Владелец = ТекущийОбъект.Ссылка;
		Иначе
			ОбъектЗначенияХарактеристики = Выборка.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
		ОбъектЗначенияХарактеристики.Наименование = Выборка.Наименование;
		ОбъектЗначенияХарактеристики.РеквизитДопУпорядочивания = Выборка.НомерСтроки;
		ОбъектЗначенияХарактеристики.ПометкаУдаления = Выборка.ПометкаУдаления;
		ОбъектЗначенияХарактеристики.Записать();
		
		СтрокаЗначения = Значения[Выборка.НомерСтроки-1];
		СтрокаЗначения.Ссылка = ОбъектЗначенияХарактеристики.Ссылка;
		
		ИзмененныеЗначения.Добавить(ОбъектЗначенияХарактеристики.Ссылка);
				
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВопросыОценкиХарактеристик()

	Если Не ДоступныВопросы Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписейВопросыОценкиХарактеристик = РегистрыСведений.ВопросыОценкиХарактеристикПерсонала.СоздатьНаборЗаписей();
	
	НаборЗаписейВопросыОценкиХарактеристик.Отбор.ХарактеристикаПерсонала.Установить(Объект.Ссылка);
	Для каждого Вопрос Из Вопросы Цикл
		НоваяЗаписьНабора = НаборЗаписейВопросыОценкиХарактеристик.Добавить();
		НоваяЗаписьНабора.ХарактеристикаПерсонала = Объект.Ссылка;
		ЗаполнитьЗначенияСвойств(НоваяЗаписьНабора, Вопрос);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписейВопросыОценкиХарактеристик.Записать(Истина);

КонецПроцедуры

&НаСервере
Процедура ОбновитьСоставЭлементовФормы(ТекстПредупреждения = "")
	
	Если Объект.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ЗначенияХарактеристикПерсонала")) Тогда
		Элементы.ГруппаЗначения.Видимость = Истина;
	Иначе
		Элементы.ГруппаЗначения.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИндексКартинкиЭлемента()
	Возврат 3;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИндексКартинкиЭлементаПометкаУдаления()
	Возврат 4;
КонецФункции

&НаКлиенте
Процедура ПередЗаписьюЗавершение(Ответ, ПараметрыЗаписи) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("СПустымСпискомЗначений");
		Записать(ПараметрыЗаписи);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
